insert  into `teachplan`(`id`,`parentid`,`grade`,`ptype`,`timelength`,`courseid`,`orderby`,`status`, `trylearn`,`pname`,`description`)
values (1, null, '1', null, null, '1', null, '0', '0', '1', null),
       (2, 1, '2', '1', null, '1', 1, '0', '0', '第1章 Redis初识', '带领听众进入Redis的世界，了解它的前世今生、众多特性、应用场景、安装配置、简单使用，可以让听众对Redis有一个全面的认识。'),
       (3, 1, '2', '1', null, '1', 2, '0', '0', '第2章 API的理解和使用', '全面介绍了Redis提供的5种数据结构字符串（string）、哈希（hash）、列表（list）、集合（set）、有序集合（zset）的数据模型、常用命令、典型应用场景。同时本章还会对Redis的单线程处理机制、键值管理做一个全面介绍，通过对这些原理的理解，听众可以在合适的应用场景选择合适的数据结构。 ... '),
       (4, 1, '2', '1', null, '1', 3, '0', '0', '第3章 Redis客户端的使用', '本章重点关注Redis客户端的开发，介绍了详细讲解了Java客户端Jedis,简单介绍下Python和Go语言的Redis客户端的选择和使用。'),
       (5, 2, '3', '1', 2, '1', 1, '0', '0', '导学', null),
       (6, 2, '3', '1', 3, '1', 2, '0', '0', 'Redis初识', null),
       (7, 2, '3', '1', 2, '1', 3, '0', '0', '谁在使用Redis', null),
       (8, 3, '3', '1', 5, '1', 1, '0', '0', '课程目录', null),
       (9, 3, '3', '1', 4, '1', 2, '0', '0', '通用命令', null),
       (10, 4, '3', '1', 6, '1', 1, '0', '0', '课程目录', null),
       (11, 4, '3', '1', 3, '1', 2, '0', '0', 'Java客户端：Jedis', null);